trade_exp/src/DataProcessors/ОбеспечениеПотребностей/ОбеспечениеПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОбеспечениеПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>МетодОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>МаксимальныйЗапас</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>УпаковкаЗаказа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>МинимальныйЗапас</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗаказыКПоступлению</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АлгоритмРасчета</name>
      <type>
        <types>CatalogRef.оп_АлгоритмыОбеспеченияПотребностей</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="027c5c77-d914-4830-b394-b64b8000f75e">
      <name>РезервыНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Обеспечено</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УпаковкаЗаказа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпособыОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Отметка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Enums/МетодыОбеспеченияПотребностей/МетодыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="879216cd-58f8-4ae5-b494-20f33e3f24f9">
  <name>МетодыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b74f2748-7203-41df-9f30-f156d7a65a40">
    <name>ЗаказПодЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="123aad71-3991-4419-bc74-de443eb42763">
    <name>ПоддержаниеЗапасаМинМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f34bc2fd-7730-4a0a-8c87-9b96562b60a7">
    <name>ПоддержаниеЗапасаНаСрокПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dbf7de1d-d86f-424f-9a63-ba8f28985133">
    <name>ПоддержаниеЗапасаНаСрокПоСтатистике</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d9d89bb4-f2d8-494d-98a7-692ea86d7c8f">
    <name>ПоддержаниеЗапасаПоАлгоритму</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/ОбеспечениеПотребностей/Forms/Форма/Module.bsl
&НаСервере
Процедура Обр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	_ДурьАльт = Истина;
	ИспользоватьУпаковки = Истина;	
КонецПроцедуры

&Вместо ("ДалееКШагуЗапасы")
Функция ОБР_ДалееКШагуЗапасы(Результат)
	
	ОчиститьОтборыЗапасы();
	
	Объект.Запасы.Очистить();
	
	Таблица = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПервоеСообщениеМинЗапас = Истина;
	ЭтоПервоеСообщениеМаксЗапас = Истина;
	ЭтоПервоеСообщениеИнтервал = Истина;
	
	Для Каждого Товар Из Таблица Цикл
	
		СтрокаЗапасы = Объект.Запасы.Добавить();
	
		ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Товар); 
		
		// Альтерра+ 
			Если Товар.Методобеспечения = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаПоАлгоритму Тогда
				Справочники.оп_АлгоритмыОбеспеченияПотребностей.РасчетДанныхСтроки(СтрокаЗапасы);
			КонецЕсли;
		// Альтерра-
	
		РезультатРасчета = Обработки.ОбеспечениеПотребностей.МинимальныйИМаксимальныйЗапасы(СтрокаЗапасы);
		ЗаполнитьЗначенияСвойств(СтрокаЗапасы, РезультатРасчета);
	
		РезультатРасчета = Обработки.ОбеспечениеПотребностей.КоличествоКЗаказуДляПоддержанияЗапаса(СтрокаЗапасы);
		ЗаполнитьЗначенияСвойств(СтрокаЗапасы, РезультатРасчета);
	
		РезультатРасчета = Обработки.ОбеспечениеПотребностей.УровеньЗапасаИКартинкаСменитьМетод(СтрокаЗапасы);
		ЗаполнитьЗначенияСвойств(СтрокаЗапасы, РезультатРасчета);
	
		СтрокаЗапасы.КЗаказуРекомендуется = СтрокаЗапасы.КЗаказу;
		СтрокаЗапасы.ИсточникОбеспечения = ОбработатьПустойИсточникОбеспечения(СтрокаЗапасы.ИсточникОбеспечения, ТекстНеЗаполнено);
		
		Если Товар.ОшибкаРасчетаИнтервалаДоДатыПоставки
				И Не Товар.ОшибкаУстановкиИнтервалаДоДатыПоставки И ЭтоПервоеСообщениеМинЗапас Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен график работы склада до даты поставки. Для расчета минимального запаса все дни до даты поставки посчитаны рабочими.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЭтоПервоеСообщениеМинЗапас = Ложь;
		КонецЕсли;
		Если Товар.ОшибкаРасчетаИнтервалаМеждуПоставками
				И Не Товар.ОшибкаУстановкиИнтервалаМеждуПоставками И ЭтоПервоеСообщениеМаксЗапас Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен график работы склада до границы обеспечиваемого периода. Для расчета максимального запаса все дни от даты поставки до границы обеспечиваемого периода посчитаны рабочими.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЭтоПервоеСообщениеМаксЗапас = Ложь;
		КонецЕсли;
		Если Товар.ОшибкаУстановкиИнтервалаМеждуПоставками И ЭтоПервоеСообщениеИнтервал Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнены даты поставки и/или граница обеспечиваемого периода. Максимальный запас в таких строках не рассчитан'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ЭтоПервоеСообщениеИнтервал = Ложь;
		КонецЕсли;

	КонецЦикла;
	
	ЗаполнитьДеревоИндексов(Истина);
	
	// Пересчет округления для всех отмеченных строк
	Для Каждого Строка Из Объект.Запасы Цикл
		Если Строка.Отметка Тогда
			// В таблице Запасы нет повторяющихся строк. Каждая строка округляется отдельно
			
			СоответствиеСтрок = Новый Соответствие();
			СоответствиеСтрок.Вставить(Строка, Истина);
			ОкруглитьСоответствиеСтрок(СоответствиеСтрок, ИспользоватьУпаковки);
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьИтогиНаСервере();
	
	УстановитьСтраницыПомощника("ШагЗапасы");
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
&Вместо ("ОткрытьМетодОбеспечения")
Процедура оп_ОткрытьМетодОбеспечения(ИмяТаблицы)

	Поставка = Элементы[ИмяТаблицы].ТекущиеДанные;
	// Альтерра+
		//КлючНоменклатуры = Новый Структура("Номенклатура, Характеристика, Склад, ЭтоРабота");
		КлючНоменклатуры = Новый Структура("Номенклатура, Характеристика, Склад, ЭтоРабота,АлгоритмРасчета");
	// Альтерра-
	
	КлючНоменклатуры.ЭтоРабота = Ложь;
	ЗаполнитьЗначенияСвойств(КлючНоменклатуры, Поставка);

	РежимОткрытия = "Полный";

	ПараметрыФормы = Новый Структура("КлючПотребности, РассчитыватьСтатистику, РежимОткрытия",
		КлючНоменклатуры, Истина, РежимОткрытия);

	ОткрытьФорму("Обработка.ОбеспечениеПотребностей.Форма.ФормаРедактированияПараметровОбеспечения", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОП_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если ВыбранноеЗначение.Свойство("УровеньЗапасаПоУсловию") Тогда
		формула=ВыбранноеЗначение.УровеньЗапасаПоУсловию;
		ФильтрУровеньЗапаса = "По условию:";
		элементы._ФормулаУровняЗапаса.Видимость=истина;
		_ФормулаУровняЗапаса=формула;
		ОбновитьФильтрУровеньЗапасаПоУсловию(Формула);
		ОтборЗапасыНаСервере();
	конецесли;
КонецПроцедуры

&Вместо ("ОтборЗапасыНаСервере")
Процедура оп_ОтборЗапасыНаСервере()

	СтруктураОтбора = Новый Структура();

	Если ФильтрОтметкаЗапасы Тогда
		СтруктураОтбора.Вставить("Отметка", Истина);
	КонецЕсли;

	Если ФильтрУровеньЗапаса <> ТекстЛюбой() Тогда

		Если КодУровняЗапаса(ФильтрУровеньЗапаса) = 3 Тогда // к отмене заказа
			СтруктураОтбора.Вставить("КОтменеЗаказаКартинка", Истина);
		ИначеЕсли КодУровняЗапаса(ФильтрУровеньЗапаса) = 1
			Или КодУровняЗапаса(ФильтрУровеньЗапаса) = 2
			Или КодУровняЗапаса(ФильтрУровеньЗапаса) = 4 Тогда
			СтруктураОтбора.Вставить("УровеньЗапаса", КодУровняЗапаса(ФильтрУровеньЗапаса));
		ИначеЕсли КодУровняЗапаса(ФильтрУровеньЗапаса) = 5 Или КодУровняЗапаса(ФильтрУровеньЗапаса) = 6 Тогда
			СтруктураОтбора.Вставить("УровеньЗапасаМаксимум", КодУровняЗапаса(ФильтрУровеньЗапаса));
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ФильтрКЗаказуНеПозднее) Тогда

		СтруктураОтбора.Вставить("УдовлетворяетОтбору", Истина);
		ОбновитьФильтрКЗаказуНеПозднееЗапасы();

	КонецЕсли;
    // изменение
	если ФильтрУровеньЗапаса="По условию:" тогда
		СтруктураОтбора.Вставить("_УровеньЗапасаПоУсловию", Истина);
	иначе
		Элементы._ФормулаУровняЗапаса.Видимость=ложь;
	конецесли;
	
	СтруктураОтбораФиксированная = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	Элементы.Запасы.ОтборСтрок = СтруктураОтбораФиксированная;

КонецПроцедуры

&НаСервере
Процедура ОбновитьФильтрУровеньЗапасаПоУсловию(Формула)
	Для каждого Строка из Объект.Запасы Цикл
		формулаРасчета=Стрзаменить(формула,"min",Строка.МинимальныйЗапас);
		формулаРасчета=Стрзаменить(формулаРасчета,"max",Строка.МаксимальныйЗапас);
		формулаРасчета=Стрзаменить(формулаРасчета,"остаток",""+Строка.Остаток+" и "+Строка.Остаток);
		формулаРасчета=СтрЗаменить(формулаРасчета,Символы.НПП,"");
		формулаРасчета=СтрЗаменить(формулаРасчета,",",".");
		попытка
			Строка._УровеньЗапасаПоУсловию=Вычислить(ФормулаРасчета);
		исключение
			Строка._УровеньЗапасаПоУсловию=ложь;
		конецпопытки;
	КонецЦикла;
КонецПроцедуры

&После ("УстановитьСтраницыПомощника")
Процедура Док_УстановитьСтраницыПомощника(ИмяШага)
	Если ИмяШага = "ШагАналоги" Тогда
		Элементы.Помощник.ТекущаяСтраница = Элементы.ШагиПотребности;
		Элементы.СтраницыКомандыИФильтрыПотребностей.ТекущаяСтраница = Элементы.СтраницаКомандыИФильтрыЗапасы;
		Элементы.СтраницаКомандыИФильтрыЗаказы.Видимость = истина;
		Элементы.СтраницаКомандыИФильтрыЗапасы.Видимость = Истина;
		Элементы.СтраницыТаблицаПотребностей.ТекущаяСтраница = Элементы.СтраницаТаблицаЗапасы;
		Элементы.ДалееСоставЗаказа.КнопкаПоУмолчанию = Истина;
		Элементы.НадписьШаг.Заголовок = НСтр("ru = 'Шаг 4 из 5. Обеспечение с учетом аналогов'");
		// видимость колонок таблицы
		Элементы.МинимальныйЗапас.Видимость=ложь;
		Элементы.МаксимальныйЗапас.Видимость=ложь;
		Элементы.СпособОбеспеченияЗапасы.Видимость=ложь;
		Элементы.МетодОбеспечения.Видимость=ложь;
	конецесли;
	Если ИмяШага = "ШагЗапасы" Тогда
		// видимость колонок таблицы
		Элементы.МинимальныйЗапас.Видимость=истина;
		Элементы.МаксимальныйЗапас.Видимость=истина;
		Элементы.СпособОбеспеченияЗапасы.Видимость=истина;
		Элементы.МетодОбеспечения.Видимость=истина;
	конецесли;
КонецПроцедуры

&НаСервере
Функция ПолучениеТаблицыАналоговВФоне()
	
	ТаблицаЗапасы = Объект.Запасы.Выгрузить();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТаблицаЗапасы", ТаблицаЗапасы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование заказов: получение таблицы аналогов к обеспечению'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ОбеспечениеПотребностей.ТаблицаПотребностейПоАналогам",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
&Вместо ("Далее")
Процедура Док_Далее(Команда)  
	
	// Альтерра+
		СФП_МаркерыКлиент.МаркерНачало("Формирование заказов по потребностям переход на шаг 2 (из формы)");
	    ОтключитьОбработчикОжидания("Док_АвтосохранениеДанных");    
    // Альтерра-
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ОбеспечениеПотребностей.Форма.Команда.Далее");
	
	ОчиститьСообщения();     
	
	// Альтерра+
		СтраницаЗапасов=ЕстьШагЗапасы и Найти(Элементы.НадписьШаг.Заголовок,"запасов")>0;
	// Альтерра-
	
	Если Элементы.Помощник.ТекущаяСтраница = Элементы.ШагОтборПотребностей Тогда
		
		ДлительнаяОперация = ПолучениеТаблицыСпособовОбеспеченияВФоне();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
			Новый ОписаниеОповещения("ПолучениеТаблицыСпособовОбеспеченияВФонеЗавершение", ЭтаФорма),
			ПараметрыОжидания);
			
	ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.ШагНастройкаСпособовОбеспечения И ЕстьШагЗапасы Тогда
		
		Если ТаблицаСпособовЗаполненаВерно() Тогда
			
			ДлительнаяОперация = ПолучениеТаблицыЗапасовВФоне();
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
				Новый ОписаниеОповещения("ПолучениеТаблицыЗапасовВФонеЗавершение", ЭтаФорма),
				ПараметрыОжидания);
			
		КонецЕсли;
	// Альтерра+
		ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.ШагиПотребности
			И Элементы.СтраницыТаблицаПотребностей.ТекущаяСтраница = Элементы.СтраницаТаблицаЗапасы И (_ЕстьШагАналоги и СтраницаЗапасов)  Тогда
 		
			ДлительнаяОперация = ПолучениеТаблицыАналоговВФоне();
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
				Новый ОписаниеОповещения("ПолучениеТаблицыАналоговВФонеЗавершение", ЭтаФорма),
				ПараметрыОжидания);
	// Альтерра-	
	
	ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.ШагНастройкаСпособовОбеспечения И Не ЕстьШагЗапасы
		Или Элементы.Помощник.ТекущаяСтраница = Элементы.ШагиПотребности 
		
		// Альтерра+
			И Элементы.СтраницыТаблицаПотребностей.ТекущаяСтраница = Элементы.СтраницаТаблицаЗапасы  и (_ЕстьШагАналоги и не СтраницаЗапасов)
			Или Элементы.СтраницыТаблицаПотребностей.ТекущаяСтраница = Элементы.СтраницаТаблицаЗапасы  и (не _ЕстьШагАналоги и СтраницаЗапасов) Тогда
		// Альтерра-
		
			ДлительнаяОперация = ПолучениеТаблицыЗаказовКОбеспечениюВФоне();
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
				Новый ОписаниеОповещения("ПолучениеТаблицыЗаказовКОбеспечениюВФонеЗавершение", ЭтаФорма),
				ПараметрыОжидания);
			
	ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.ШагиПотребности
		И Элементы.СтраницыТаблицаПотребностей.ТекущаяСтраница = Элементы.СтраницаТаблицаЗаказы Тогда 
		
		ПредварительныйПросмотр.ПолучитьЭлементы().Очистить();
		ДлительнаяОперация = ФормированиеДереваЗаказовВФоне();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
			Новый ОписаниеОповещения("ПереходКРедактированиюЗаказовЗавершение", ЭтаФорма),
			ПараметрыОжидания);       
			
	ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.ШагРедактированиеЗаказов Тогда
	
		КШагуДокументыНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьШагАналоги()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ТаблицаОбеспечения.СпособОбеспечения КАК СпособОбеспечения
		|ПОМЕСТИТЬ ВР
		|ИЗ
		|	&ТаблицаОбеспечения КАК ТаблицаОбеспечения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ первые 1
		|	ВР.СпособОбеспечения КАК СпособОбеспечения
		|ИЗ
		|	ВР КАК ВР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпособыОбеспеченияПотребностей
		|		ПО ВР.СпособОбеспечения = СпособыОбеспеченияПотребностей.Ссылка
		|ГДЕ
		|	СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.типыОбеспечения.Перемещение)";
	
	Запрос.УстановитьПараметр("ТаблицаОбеспечения", Объект.СпособыОбеспечения.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	возврат не РезультатЗапроса.Пустой();


КонецФункции

&НаКлиенте
Процедура ПолучениеТаблицыАналоговВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	ИначеЕсли Не ДалееКШагуАналоги(Результат) Тогда
		КШагуДокументыНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДалееКШагуАналоги(Результат)
    
	КорзинаЗаказовИтогПолеСтрокВсего = 0;
	КорзинаЗаказовИтогПолеСумма      = 0;
	КорзинаЗаказовИтогПолеОбщийВес   = 0;

	Таблица = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат Ложь;
	КонецЕсли;
	ОтборСтрок=Новый Структура("ИзменениеАналога",истина);
	если Таблица.НайтиСтроки(ОтборСтрок).Количество()=0 тогда
		возврат ложь;
	конецесли;	
	
	Для Каждого Товар Из Таблица Цикл
	
		СтрокаЗапасы=Объект.Запасы.НайтиСтроки(Новый Структура("ИдИндекса",Товар.ИдИндекса))[0];
		ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Товар);
		
	КонецЦикла;

	//ИндексыПоискаТаблицаСортировки
	ЗаполнитьДеревоИндексов(Истина);
	
	// Пересчет округления для всех отмеченных строк
	Для Каждого Строка Из Объект.Запасы Цикл
		Если Строка.Отметка Тогда
			// В таблице Запасы нет повторяющихся строк. Каждая строка округляется отдельно
			
			СоответствиеСтрок = Новый Соответствие();
			СоответствиеСтрок.Вставить(Строка, Истина);
			ОкруглитьСоответствиеСтрок(СоответствиеСтрок, ИспользоватьУпаковки);
		КонецЕсли;
	КонецЦикла;
	
	//КорзинаЗаказов.ПолучитьЭлементы().Очистить();
	//КорзинаЗаказов.ПолучитьЭлементы().Очистить();
	
	РассчитатьИтогиНаСервере(); // ЗаполнитьКорзинуЗаказов("Запасы");

	УстановитьСтраницыПомощника("ШагАналоги");
   
	Возврат Истина;
КонецФункции

&НаКлиенте
&После ("ПолучениеТаблицыСпособовОбеспеченияВФонеЗавершение")
Процедура Док_ПолучениеТаблицыСпособовОбеспеченияВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат.Статус <> "Ошибка" Тогда
		_ЕстьШагАналоги=ОпределитьШагАналоги();
	КонецЕсли;	
КонецПроцедуры

#Область Автосохранение

&НаСервере
Процедура Док_СохранитьДанныеПослеНаСервере()
	КлючНастроек = "ОбеспечениеПотребностейЗаказыНаПеремещения";
	Настройки = Новый Соответствие;
	Настройки.Вставить("Запасы", Объект.Запасы.Выгрузить());
	Настройки.Вставить("ЗаказыКОбеспечению", Объект.ЗаказыКОбеспечению.Выгрузить());
    НомерШага = Сред(Элементы.НадписьШаг.Заголовок, 5, 1);
    Если НомерШага = "3" Тогда
	    Настройки.Вставить("ИмяШага", "ШагЗапасы");
    ИначеЕсли НомерШага = "4" Тогда
        Настройки.Вставить("ИмяШага", "ШагАналоги");
    КонецЕсли;
    Настройки.Вставить("_ЕстьШагАналоги", _ЕстьШагАналоги);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ОбеспечениеПотребностей", КлючНастроек, Настройки);
КонецПроцедуры

&НаКлиенте
Процедура Док_СохранитьДанныеПосле(Команда)
    Док_СохранитьДанныеПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док_ВосстановитьСохраненныеДанныеПослеНаСервере()
	КлючНастроек = "ОбеспечениеПотребностейЗаказыНаПеремещения";
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ОбеспечениеПотребностей", КлючНастроек);
	
	ИмяШага = ЗначениеНастроек.Получить("ИмяШага");
    _ЕстьШагАналоги = ЗначениеНастроек.Получить("_ЕстьШагАналоги");

	Объект.Запасы.Загрузить(ЗначениеНастроек.Получить("Запасы"));
	Объект.ЗаказыКОбеспечению.Загрузить(ЗначениеНастроек.Получить("ЗаказыКОбеспечению"));
	
	ЗаполнитьДеревоИндексов(Истина); 
	РассчитатьИтогиНаСервере(); // ЗаполнитьКорзинуЗаказов("Запасы");
	УстановитьСтраницыПомощника(ИмяШага);
КонецПроцедуры

&НаКлиенте
Процедура Док_ВосстановитьСохраненныеДанныеПосле(Команда)
    Док_ВосстановитьСохраненныеДанныеПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Док_АвтосохранениеДанных() Экспорт
    Док_СохранитьДанныеПослеНаСервере();
КонецПроцедуры

&НаКлиенте
&Перед("КШагуДокументыНаКлиенте")
Процедура Док_КШагуДокументыНаКлиенте()
	РассчитатьИтоги();
КонецПроцедуры


#КонецОбласти
